/*====================================================================================
 *
 * Copyright (C) Ruvendix. All Rights Reserved.
 *
 * <작성 날짜>
 * 2018-08-11 (AssortRock 전용으로 수정)
 *
 * <파일 내용>
 * 공동으로 사용되는 헤더파일 모음입니다.
 * 미리 컴파일된 헤더파일에 포함됩니다.
 * 기본 공용 헤더파일과 프로젝트 자체 공용 헤더파일이 포함됩니다.
 *
 ====================================================================================*/
#ifndef COMMON_H__
#define COMMON_H__

// =====================================================================================
// 기본 공용 헤더파일
// =====================================================================================
#include "common_base.h"

// =====================================================================================
// 프로젝트 자체 헤더파일
// =====================================================================================
#include "global_constant.h"
#include "global_type.h"
#include "global_variable_declaration.h"
#include "global_function.h"
#include "macro.h"

#include "base\misc\RXBaseInterface.h"

#include "..\resource.h"

#endif